docs/benchmarks/raw/l40s-2026-08-23/machine/A-r4.0.txt
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x767075bbcc20>, trust_remote_code=False, seed=0, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1500, random_output_len=200, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/run2', result_filename='A-r4.0.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=['ttft:300', 'tpot:50'], request_id_prefix='bench-e17e7168-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-23 08:33:19 [utils.py:90] Sampling input_len from [1500, 1500] and output_len from [200, 200]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 300/300 [01:23<00:00,  3.61it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  83.01     
Total input tokens:                      450000    
Total generated tokens:                  60000     
Request throughput (req/s):              3.61      
Request goodput (req/s):                 0.12      
Output token throughput (tok/s):         722.77    
Peak output token throughput (tok/s):    1600.00   
Peak concurrent requests:                111.00    
Total token throughput (tok/s):          6143.56   
---------------Time to First Token----------------
Mean TTFT (ms):                          537.93    
Median TTFT (ms):                        461.45    
P50 TTFT (ms):                           461.45    
P90 TTFT (ms):                           922.79    
P99 TTFT (ms):                           1723.72   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          97.44     
Median TPOT (ms):                        102.60    
P50 TPOT (ms):                           102.60    
P90 TPOT (ms):                           123.81    
P99 TPOT (ms):                           126.96    
---------------Inter-token Latency----------------
Mean ITL (ms):                           97.44     
Median ITL (ms):                         55.76     
P50 ITL (ms):                            55.76     
P90 ITL (ms):                            209.75    
P99 ITL (ms):                            232.32    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          19927.59  
Median E2EL (ms):                        20985.52  
P50 E2EL (ms):                           20985.52  
P90 E2EL (ms):                           25116.65  
P99 E2EL (ms):                           25895.98  
==================================================